dvtung0611/STM32-Embedded-Framework/drivers/stm32f407/mcu/inc/rcc-driver.h
/**
 * @RCC_CSR
 */
#define RCC_CSR_LSION_Pos           (0U)    /*!< Internal low-speed oscillator enable           | Bit 0 */
#define RCC_CSR_LSIRDY_Pos          (1U)    /*!< Internal low-speed oscillator ready            | Bit 1 */
#define RCC_CSR_RMVF_Pos            (24U)   /*!< Remove reset flag                              | Bit 24 */
#define RCC_CSR_BORRSTF_Pos         (25U)   /*!< BOR reset flag                                 | Bit 25 */
#define RCC_CSR_PINRSTF_Pos         (26U)   /*!< PIN reset flag                                 | Bit 26 */
#define RCC_CSR_PORRSTF_Pos         (27U)   /*!< POR/PDR reset flag                             | Bit 27 */
#define RCC_CSR_SFTRSTF_Pos         (28U)   /*!< Software reset flag                            | Bit 28 */
#define RCC_CSR_IWDGRSTF_Pos        (29U)   /*!< Independent watchdog reset flag                | Bit 29 */
#define RCC_CSR_WWDGRSTF_Pos        (30U)   /*!< Window watchdog reset flag                     | Bit 30 */
#define RCC_CSR_LPWRRSTF_Pos        (31U)   /*!< Low-power reset flag                           | Bit 31 */


/**
 * @RCC_SSCGR
 */
#define RCC_SSCGR_MODPER_Pos        (0U)    /*!< Modulation period              | Bits 12:0  */
#define RCC_SSCGR_INCSTEP_Pos       (13U)   /*!< Increment step                 | Bits 27:13 */
#define RCC_SSCGR_SPREADSEL_Pos     (30U)   /*!< Spread select                  | Bit 30     */
#define RCC_SSCGR_SSCGEN_Pos        (31U)   /*!< Spread spectrum enable         | Bit 31     */


/**
 * @RCC_PLLI2SCFGR
 */
#define RCC_PLLI2SCFGR_PLLI2SN_Pos  (6U)    /*!< PLLI2S multiplication factor for VCO   | Bits 14:6  */
#define RCC_PLLI2SCFGR_PLLI2SR_Pos  (28U)   /*!< PLLI2S division factor for I2S clocks  | Bits 30:28 */


/* ================================================== DEFINITIONS =================================================== */

/**
 * @RCC_BUS_ENCODING
 * 
 * [31:16] : Bus Offset
 * [15:0]  : RCC peripheral
 */
typedef enum
{
    RCC_BUS_AHB1 = (1U << 16),
    RCC_BUS_AHB2 = (2U << 16),
    RCC_BUS_AHB3 = (3U << 16),
    RCC_BUS_APB1 = (4U << 16),
    RCC_BUS_APB2 = (5U << 16)
} RCC_Bus_t;


/**
 * @RCC_PERIPHERAL
 */
typedef enum
{
    /* SYSCFG */
    RCC_PERIPHERAL_SYSCFG = RCC_BUS_APB2 | RCC_APB2ENR_SYSCFGEN_Pos,

    /* GPIO */
    RCC_PERIPHERAL_GPIOA  = RCC_BUS_AHB1 | RCC_AHB1ENR_GPIOAEN_Pos,
    RCC_PERIPHERAL_GPIOB  = RCC_BUS_AHB1 | RCC_AHB1ENR_GPIOBEN_Pos,
    RCC_PERIPHERAL_GPIOC  = RCC_BUS_AHB1 | RCC_AHB1ENR_GPIOCEN_Pos,
    RCC_PERIPHERAL_GPIOD  = RCC_BUS_AHB1 | RCC_AHB1ENR_GPIODEN_Pos,
    RCC_PERIPHERAL_GPIOE  = RCC_BUS_AHB1 | RCC_AHB1ENR_GPIOEEN_Pos,
    RCC_PERIPHERAL_GPIOF  = RCC_BUS_AHB1 | RCC_AHB1ENR_GPIOFEN_Pos,
    RCC_PERIPHERAL_GPIOG  = RCC_BUS_AHB1 | RCC_AHB1ENR_GPIOGEN_Pos,
    RCC_PERIPHERAL_GPIOH  = RCC_BUS_AHB1 | RCC_AHB1ENR_GPIOHEN_Pos,
    RCC_PERIPHERAL_GPIOI  = RCC_BUS_AHB1 | RCC_AHB1ENR_GPIOIEN_Pos,

    /* SPI */
    RCC_PERIPHERAL_SPI1   = RCC_BUS_APB2 | RCC_APB2ENR_SPI1EN_Pos,
    RCC_PERIPHERAL_SPI2   = RCC_BUS_APB1 | RCC_APB1ENR_SPI2EN_Pos,
    RCC_PERIPHERAL_SPI3   = RCC_BUS_APB1 | RCC_APB1ENR_SPI3EN_Pos,

    /* I2C */
    RCC_PERIPHERAL_I2C1   = RCC_BUS_APB1 | RCC_APB1ENR_I2C1EN_Pos,
    RCC_PERIPHERAL_I2C2   = RCC_BUS_APB1 | RCC_APB1ENR_I2C2EN_Pos,
    RCC_PERIPHERAL_I2C3   = RCC_BUS_APB1 | RCC_APB1ENR_I2C3EN_Pos,

    /* USART/UART */
    RCC_PERIPHERAL_USART1 = RCC_BUS_APB2 | RCC_APB2ENR_USART1EN_Pos,
    RCC_PERIPHERAL_USART2 = RCC_BUS_APB1 | RCC_APB1ENR_USART2EN_Pos,
    RCC_PERIPHERAL_USART3 = RCC_BUS_APB1 | RCC_APB1ENR_USART3EN_Pos,
    RCC_PERIPHERAL_UART4  = RCC_BUS_APB1 | RCC_APB1ENR_UART4EN_Pos,
    RCC_PERIPHERAL_UART5  = RCC_BUS_APB1 | RCC_APB1ENR_UART5EN_Pos,
    RCC_PERIPHERAL_USART6 = RCC_BUS_APB2 | RCC_APB2ENR_USART6EN_Pos,

    /* TIMER - APB1 */
    RCC_PERIPHERAL_TIM2   = RCC_BUS_APB1 | RCC_APB1ENR_TIM2EN_Pos,
    RCC_PERIPHERAL_TIM3   = RCC_BUS_APB1 | RCC_APB1ENR_TIM3EN_Pos,
    RCC_PERIPHERAL_TIM4   = RCC_BUS_APB1 | RCC_APB1ENR_TIM4EN_Pos,
    RCC_PERIPHERAL_TIM5   = RCC_BUS_APB1 | RCC_APB1ENR_TIM5EN_Pos,
    RCC_PERIPHERAL_TIM6   = RCC_BUS_APB1 | RCC_APB1ENR_TIM6EN_Pos,
    RCC_PERIPHERAL_TIM7   = RCC_BUS_APB1 | RCC_APB1ENR_TIM7EN_Pos,
    RCC_PERIPHERAL_TIM12  = RCC_BUS_APB1 | RCC_APB1ENR_TIM12EN_Pos,
    RCC_PERIPHERAL_TIM13  = RCC_BUS_APB1 | RCC_APB1ENR_TIM13EN_Pos,
    RCC_PERIPHERAL_TIM14  = RCC_BUS_APB1 | RCC_APB1ENR_TIM14EN_Pos,

    /* TIMERS - APB2 */
    RCC_PERIPHERAL_TIM1   = RCC_BUS_APB2 | RCC_APB2ENR_TIM1EN_Pos,
    RCC_PERIPHERAL_TIM8   = RCC_BUS_APB2 | RCC_APB2ENR_TIM8EN_Pos,
    RCC_PERIPHERAL_TIM9   = RCC_BUS_APB2 | RCC_APB2ENR_TIM9EN_Pos,
    RCC_PERIPHERAL_TIM10  = RCC_BUS_APB2 | RCC_APB2ENR_TIM10EN_Pos,
    RCC_PERIPHERAL_TIM11  = RCC_BUS_APB2 | RCC_APB2ENR_TIM11EN_Pos,

    /* ADC */
    RCC_PERIPHERAL_ADC1   = RCC_BUS_APB2 | RCC_APB2ENR_ADC1EN_Pos,
    RCC_PERIPHERAL_ADC2   = RCC_BUS_APB2 | RCC_APB2ENR_ADC2EN_Pos,
    RCC_PERIPHERAL_ADC3   = RCC_BUS_APB2 | RCC_APB2ENR_ADC3EN_Pos,

    /* DMA */
    RCC_PERIPHERAL_DMA1   = RCC_BUS_AHB1 | RCC_AHB1ENR_DMA1EN_Pos,
    RCC_PERIPHERAL_DMA2   = RCC_BUS_AHB1 | RCC_AHB1ENR_DMA2EN_Pos,

    /* Others */
    RCC_PERIPHERAL_CRC    = RCC_BUS_AHB1 | RCC_AHB1ENR_CRCEN_Pos,
    RCC_PERIPHERAL_PWR    = RCC_BUS_APB1 | RCC_APB1ENR_PWREN_Pos,
    RCC_PERIPHERAL_SDIO   = RCC_BUS_APB2 | RCC_APB2ENR_SDIOEN_Pos
} RCC_Peripheral_t;


/**
 * @RCC_FUNCTION_STATUS
 */
typedef enum
{
    RCC_FUNC_STATUS_OK = 0U,
    RCC_FUNC_STATUS_BUSY,
    RCC_FUNC_STATUS_ERROR,
    RCC_FUNC_STATUS_INVALID_PARAMETER
} RCC_FunctionStatus_t;


/**
 * @RCC_SYSTEM_CLOCK_SOURCE
 */
typedef enum
{
    RCC_SYSTEM_CLOCK_SOURCE_HSI = 0U,
    RCC_SYSTEM_CLOCK_SOURCE_HSE,
    RCC_SYSTEM_CLOCK_SOURCE_PLL
} RCC_SystemClockSource_t;


/**
 * @RCC_PLL_CLOCK_SOURCE
 */
typedef enum
{
    RCC_PLL_CLOCK_SOURCE_HSI = 0U,
    RCC_PLL_CLOCK_SOURCE_HSE,
} RCC_PLLClockSource_t;


/* ====================================================== APIs ====================================================== */

/**
 * @brief Enable clock for a peripheral.
 * 
 * @param peripheral Peripheral to enable clock for.
 * 
 * @return RCC_FunctionStatus_t
 *      - RCC_FUNC_STATUS_OK    : Clock enabled successfully.
 *      - RCC_FUNC_STATUS_ERROR : Invalid peripheral encoding.
 * 
 * @details This function enables the clock signal for the specified peripheral
 *          by setting the corresponding bit in the RCC clock enable register.
 * 
 *          Peripheral information is encoded in RCC_Peripheral_t:
 *          - [31:16] : Bus identifier (AHB1, AHB2, AHB3, APB1, APB2)
 *          - [15:0]  : Bit position inside the corresponding ENR register
 */
RCC_FunctionStatus_t RCC_EnablePeripheralClock(RCC_Peripheral_t peripheral);


/**
 * @brief Disable clock for a peripheral.
 * 
 * @param peripheral Peripheral to disable clock for.
 * 
 * @return RCC_FunctionStatus_t
 *      - RCC_FUNC_STATUS_OK    : Clock disabled successfully.
 *      - RCC_FUNC_STATUS_ERROR : Invalid peripheral encoding.
 * 
 * @details This function disables the clock signal for the specified peripheral
 *          by setting the corresponding bit in the RCC clock disable register.
 * 
 *          Peripheral information is encoded in RCC_Peripheral_t:
 *          - [31:16] : Bus identifier (AHB1, AHB2, AHB3, APB1, APB2)
 *          - [15:0]  : Bit position inside the corresponding ENR register
 */
RCC_FunctionStatus_t RCC_DisablePeripheralClock(RCC_Peripheral_t peripheral);


/**
 * @brief Reset a peripheral.
 * 
 * @param peripheral Peripheral to reset.
 * 
 * @return RCC_FunctionStatus_t
 *      - RCC_FUNC_STATUS_OK    : Peripheral reset successfully.
 *      - RCC_FUNC_STATUS_ERROR : Invalid peripheral encoding.
 * 
 * @details This function performs a hardware reset of the specified peripheral
 *          by generating a reset pulse on the corresponding RCC reset register.
 * 
 *          The reset is done by setting the bit first and then clearing it.
 * 
 *          Peripheral information is encoded in RCC_Peripheral_t:
 *          - [31:16] : Bus identifier (AHB1, AHB2, AHB3, APB1, APB2)
 *          - [15:0]  : Bit position inside the corresponding RSTR register
 */
RCC_FunctionStatus_t RCC_ResetPeripheral(RCC_Peripheral_t peripheral);


/**
 * @brief Get the current system clock source.
 * 
 * @return RCC_SystemClockSource_t: Current system clock source selected by the hardware.
 *         - RCC_SYSTEM_CLOCK_SOURCE_HSI : HSI oscillator is used as SYSCLK.
 *         - RCC_SYSTEM_CLOCK_SOURCE_HSE : HSE oscillator is used as SYSCLK.
 *         - RCC_SYSTEM_CLOCK_SOURCE_PLL : PLL output is used as SYSCLK.
 * 
 * @details This function reads the SWS (System Clock Switch Status) field
 *          in the RCC_CFGR register to determine the clock source currently
 *          driving the system clock.
 * @note
 * Refer to:
 * - RM0090 Reference Manual,   Section 7.3.3 RCC clock configuration register (RCC_CFGR)
 */
RCC_SystemClockSource_t RCC_GetSystemClockSource(void);


/**
 * @brief Get the clock source used by the PLL.
 * 
 * @return RCC_PLLClockSource_t: PLL input clock source.
 *         - RCC_PLL_CLOCK_SOURCE_HSI : HSI oscillator is used as PLL source.
 *         - RCC_PLL_CLOCK_SOURCE_HSE : HSE oscillator is used as PLL source.
 * 
 * @details This function reads the PLLSRC bit in the RCC_PLLCFGR register
 *          to determine which clock source is currently feeding the PLL.
 * 
 * @note
 * Refer to:
 * - RM0090 Reference Manual,   Section 7.3.2 RCC PLL configuration register (RCC_PLLCFGR)
 */
RCC_PLLClockSource_t RCC_GetPLLClockSource(void);


/**
 * @brief Get the current system clock frequency.
 * 
 * @return uint32_t System clock frequency in Hertz (Hz).
 * 
 * @details The frequency is determined according to the current SYSCLK source:
 *          - HSI : Returns 16 MHz.
 *          - HSE : Returns HSE_VALUE.
 *          - PLL : Calculates the PLL output frequency using the configured
 *                  PLL source, PLLM, PLLN, and PLLP parameters.
 * 
 *          PLL frequency is calculated as: PLLCLK = (PLL Source × PLLN / PLLM) / PLLP
 *          where PLL Source is either HSI (16 MHz) or HSE (HSE_VALUE).
 * 
 * @note This function returns the SYSCLK frequency only. It does not account
 *       for AHB or APB prescalers.
 * Refer to:
 * - RM0090 Reference Manual,   Section 7.3.2 RCC PLL configuration register (RCC_PLLCFGR)
 */
uint32_t RCC_GetSystemClockFreq(void);


/**
 * @brief Get the current AHB bus clock frequency (HCLK).
 * 
 * @return HCLK frequency in Hertz (Hz).
 * 
 * @details This function calculates the HCLK frequency based on the
 *          current SYSCLK frequency and the AHB prescaler (HPRE).
 * 
 *          HCLK is derived from SYSCLK as follows: HCLK = SYSCLK / AHB_Prescaler
 * 
 *          HPRE encoding:
 *              0xxx : SYSCLK not divided
 *              1000 : SYSCLK divided by 2
 *              1001 : SYSCLK divided by 4
 *              1010 : SYSCLK divided by 8
 *              1011 : SYSCLK divided by 16
 *              1100 : SYSCLK divided by 64
 *              1101 : SYSCLK divided by 128
 *              1110 : SYSCLK divided by 256
 *              1111 : SYSCLK divided by 512
 * 
 * @note HCLK is the clock supplied to the Cortex-M core, AHB bus,
 *       DMA, SRAM, and other AHB peripherals.
 * 
 * Refer to:
 * - RM0090 Reference Manual,   Section 7.3.3 RCC clock configuration register (RCC_CFGR)
 */
uint32_t RCC_GetHCLKFreq(void);


/**
 * @brief Get the current APB1 bus clock frequency (PCLK1).
 * 
 * @return PCLK1 frequency in Hertz (Hz).
 * 
 * @details This function calculates the APB1 peripheral clock frequency
 *          based on the current HCLK frequency and the APB1 prescaler
 *          (PPRE1).
 * 
 *          PCLK1 is derived from HCLK as follows: PCLK1 = HCLK / APB1_Prescaler
 * 
 *          PPRE1 encoding:
 *              0xx : HCLK not divided
 *              100 : HCLK divided by 2
 *              101 : HCLK divided by 4
 *              110 : HCLK divided by 8
 *              111 : HCLK divided by 16
 * 
 * @note PCLK1 is the clock supplied to peripherals connected to the
 *       APB1 bus, such as USART2/3, UART4/5, SPI2/3, I2C1/2/3, TIM2-TIM7, and others.
 * 
 * Refer to:
 * - RM0090 Reference Manual,   Section 7.3.3 RCC clock configuration register (RCC_CFGR)
 */
uint32_t RCC_GetPCLK1Freq(void);


/**
 * @brief Get the current APB2 bus clock frequency (PCLK2).
 * 
 * @return PCLK2 frequency in Hertz (Hz).
 * 
 * @details This function calculates the APB2 peripheral clock frequency
 *          based on the current HCLK frequency and the APB2 prescaler
 *          (PPRE2).
 * 
 *          PCLK2 is derived from HCLK as follows:
 * 
 *              PCLK2 = HCLK / APB2_Prescaler
 * 
 *          PPRE2 encoding:
 *              0xx : HCLK not divided
 *              100 : HCLK divided by 2
 *              101 : HCLK divided by 4
 *              110 : HCLK divided by 8
 *              111 : HCLK divided by 16
 * 
 * @note PCLK2 is the clock supplied to peripherals connected to the
 *       APB2 bus, such as USART1/6, SPI1, TIM1, TIM8, ADC, and others.
 * 
 * Refer to:
 * - RM0090 Reference Manual,   Section 7.3.3 RCC clock configuration register (RCC_CFGR)
 */
uint32_t RCC_GetPCLK2Freq(void);


/**
 * @brief Get the clock frequency supplied to I2C peripherals.
 *
 * @return I2C peripheral clock frequency in Hertz (Hz).
 *
 * @note On STM32F4, all I2C peripherals are connected to the APB1 bus
 *       and use PCLK1 as their clock source.
 */
uint32_t RCC_GetI2CClockFreq(void);


/**
 * @brief Check whether the HSI oscillator is ready.
 * 
 * @return
 *      - 1 : HSI is stable and ready.
 *      - 0 : HSI is not ready.
 */
uint8_t RCC_IsHSIReady(void);


/**
 * @brief Check whether the HSE oscillator is ready.
 * 
 * @return
 *      - 1 : HSE is stable and ready.
 *      - 0 : HSE is not ready.
 */
uint8_t RCC_IsHSEReady(void);


/**
 * @brief Check whether the PLL is locked and ready.
 * 
 * @return
 *      - 1 : PLL is ready.
 *      - 0 : PLL is not ready.
 */
uint8_t RCC_IsPLLReady(void);


#endif /* INC_RCC_DRIVER_H_ */